app/views/devise/registrations/_plans.html.erb

    <br />
    <%= collection_select( nil, :plan_id, Plan.all.order(:amount), :stripe_id, :name, {:selected => @user.subscription.plan.stripe_id, :prompt => true}, {class: 'form-control col-md-6'}) %>
---
SELECT "plans".* FROM "plans" ORDER BY "plans"."amount" ASC