app/views/payment_profiles/_plans.html.erb


<% @payment_profile.user.subscriptions.each do |s| %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ?  [["user_id", 13]]

    <div class="field">
      <%= collection_select( nil, :plan_id, Plan.all.order(:amount), :stripe_id, :name, {:selected => s.plan.stripe_id, :prompt => true}, {class: 'form-control'}) %>
---
SELECT "plans".* FROM "plans" ORDER BY "plans"."amount" ASC