app/controllers/payment_profiles_controller.rb

SELECT "payment_profiles".* FROM "payment_profiles"
---
  def index
    @payment_profiles = PaymentProfile.all

SELECT  "payment_profiles".* FROM "payment_profiles" WHERE "payment_profiles"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 23], ["LIMIT", 1]]
SELECT  "payment_profiles".* FROM "payment_profiles" WHERE "payment_profiles"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
---
  def show
    authorize @payment_profile
    customer = FetchStripeCustomer.call(@payment_profile.user)
    if @payment_profile.user.payment_profile.errors.any?
      render 'show'
      return
    end

    @charges = []
    Charge.where(:user_id => current_user.id).each do |c|
      stripe_charge = FetchStripeCharge.call(@payment_profile.user, c.charge_stripe_id)
      if @payment_profile.user.payment_profile.errors.any?

SELECT  "payment_profiles".* FROM "payment_profiles" WHERE "payment_profiles"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 1]]
---
  def edit
    authorize @payment_profile
    customer = FetchStripeCustomer.call(@payment_profile.user)
    if @payment_profile.user.payment_profile.errors.any?
      render 'edit'
      return
    end

    # Sync Plan With Stripe
    customer.subscriptions.each do |s|

SELECT  "payment_profiles".* FROM "payment_profiles" WHERE "payment_profiles"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "plans".* FROM "plans" WHERE "plans"."stripe_id" = ? LIMIT ?  [["stripe_id", "gold_plan"], ["LIMIT", 1]]
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."stripe_id" = ? LIMIT ?  [["user_id", 13], ["stripe_id", "sub_8zBHSHKNH6i9aU"], ["LIMIT", 1]]
UPDATE "subscriptions" SET "plan_id" = ?, "updated_at" = ? WHERE "subscriptions"."id" = ?  [["plan_id", 2], ["updated_at", 2016-08-12 14:45:38 UTC], ["id", 32]]
---
  def switch_plan
    stripe_customer = FetchStripeCustomer.call(@payment_profile.user)
    if @payment_profile.user.payment_profile.errors.any?
      render 'edit'
      return
    end
    ChangePlan.call(@payment_profile.user, stripe_customer, params[:stripe_subscription_id], params[:from_plan], params[:plan_id])
    if @payment_profile.user.payment_profile.errors.any?
      render 'edit'
      return
    end
    subscription = current_user.subscriptions.find_by_stripe_id(params[:stripe_subscription_id])
    if subscription
      subscription.plan = Plan.find_by_stripe_id(params[:plan_id])
      subscription.save!

SELECT  "payment_profiles".* FROM "payment_profiles" WHERE "payment_profiles"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def add_card

    stripe_customer = FetchStripeCustomer.call(@payment_profile.user)
    if @payment_profile.user.payment_profile.errors.any?

SELECT  "payment_profiles".* FROM "payment_profiles" WHERE "payment_profiles"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "plans".* FROM "plans" WHERE "plans"."stripe_id" = ? LIMIT ?  [["stripe_id", "starter_plan"], ["LIMIT", 1]]
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ?  [["user_id", 13]]
UPDATE "subscriptions" SET "plan_id" = ?, "updated_at" = ? WHERE "subscriptions"."id" = ?  [["plan_id", 1], ["updated_at", 2016-08-12 16:40:11 UTC], ["id", 32]]
---
  def remove_card
    stripe_customer = FetchStripeCustomer.call(@payment_profile.user)
    if @payment_profile.user.payment_profile.errors.any?
      render 'edit'
      return
    end

    RemoveCardFromStripeCustomer.call(@payment_profile.user, stripe_customer, params[:fingerprint])
    if @payment_profile.user.payment_profile.errors.any?
      render 'edit'
      return
    end

    if stripe_customer.sources.count == 0
      NoCardsSoDowngradeToFreePlans.call(@payment_profile.user, stripe_customer)
      if @payment_profile.user.payment_profile.errors.any?
        render 'edit'
        return
      end
      current_user.subscriptions.each do |s|
        if s
          s.plan = Plan.find_by_stripe_id('starter_plan')
          s.save!

SELECT  "payment_profiles".* FROM "payment_profiles" WHERE "payment_profiles"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  1 AS one FROM "payment_profiles" WHERE "payment_profiles"."user_id" = ? AND ("payment_profiles"."id" != ?) LIMIT ?  [["user_id", 10], ["id", 11], ["LIMIT", 1]]
---
  def set_default_card

    stripe_customer = FetchStripeCustomer.call(@payment_profile.user)
    if @payment_profile.user.payment_profile.errors.any?

SELECT  "payment_profiles".* FROM "payment_profiles" WHERE "payment_profiles"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
    def set_payment_profile
      @payment_profile = PaymentProfile.find(params[:id])