app/controllers/plans_controller.rb

SELECT "plans".* FROM "plans"
---
  def index
    @plans = Plan.all

UPDATE "plans" SET "description" = ?, "updated_at" = ? WHERE "plans"."id" = ?
---
  def update
    respond_to do |format|
      if @plan.update(plan_params)

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_plan
      @plan = Plan.find(params[:id])